{
  "items": [
    {
      "title": "Work",
      "icon": "briefcase",
      "isFree": true,
      "excuses": [
        "My WiFi saw the meeting invite and quit out of protest.",
        "My cat scheduled a Zoom call of its own and hijacked my laptop.",
        "The printer demanded a blood sacrifice before it would work.",
        "I was locked in an epic battle with a spreadsheet formula.",
        "My keyboard went on strike and only typed emojis.",
        "I thought today was Saturday until my boss called.",
        "My calendar double-booked me with a nap.",
        "I spilled coffee on my work badge and it stopped scanning.",
        "My headset tangled itself into a Gordian knot.",
        "The office plants staged a revolt and I had to negotiate peace."
      ]
    },
    {
      "title": "Social",
      "icon": "people",
      "isFree": true,
      "excuses": [
        "I was abducted by a particularly clingy couch.",
        "I fell asleep trying to pick an outfit.",
        "My fridge begged me to keep it company.",
        "I got lost scrolling memes and never found my way back.",
        "My dog threw a party and I had to supervise.",
        "I was cursed by Netflix’s ‘Next Episode’ button.",
        "I accidentally RSVP’d yes to my own imaginary event.",
        "I was too busy pretending to be busy.",
        "My horoscope said ‘stay home or else’.",
        "I got stuck in traffic… in my kitchen."
      ]
    },
    {
      "title": "Family",
      "icon": "home",
      "isFree": true,
      "excuses": [
        "My toddler changed the WiFi password and forgot it.",
        "We were reenacting a soap opera at dinner.",
        "Grandma challenged me to Mario Kart and refused to lose.",
        "Our dog ate the car keys, again.",
        "I had to mediate a debate about pineapple on pizza.",
        "Family karaoke night turned into a hostage situation.",
        "We lost the TV remote and it became a family emergency.",
        "Someone hid the snacks and we launched a full investigation.",
        "Uncle Bob started telling a story that lasted three hours.",
        "Our board game turned into a war crime tribunal."
      ]
    },
    {
      "title": "School",
      "icon": "school",
      "isFree": true,
      "excuses": [
        "My homework was eaten by AI instead of the dog.",
        "I accidentally submitted my grocery list instead of my essay.",
        "The WiFi only worked for TikTok, not assignments.",
        "I had to finish a side quest before doing homework.",
        "My alarm clock hit snooze on me.",
        "I couldn’t attend class, I was binge-studying memes.",
        "The teacher’s email went to my spam folder labeled ‘bad vibes’.",
        "I mistook my math homework for abstract art.",
        "My pencil unionized and refused to write.",
        "I was late because my backpack staged a sit-in."
      ]
    },
    {
      "title": "Creative",
      "icon": "create",
      "isFree": true,
      "excuses": [
        "I was trapped brainstorming the perfect excuse.",
        "Aliens gave me homework of their own.",
        "My muse ghosted me at the last second.",
        "The canvas rejected my artistic vision.",
        "I was too busy drawing a self-portrait as a potato.",
        "My creative energy was stolen by a raccoon.",
        "I had to duel with Photoshop until dawn.",
        "My pen ink ran away with the highlighter.",
        "I wrote my idea on a napkin and then ate it accidentally.",
        "The voices in my head couldn’t agree on a concept."
      ]
    },
    {
      "title": "Funny",
      "icon": "happy",
      "isFree": true,
      "excuses": [
        "I was kidnapped by my blanket and Stockholm syndrome set in.",
        "My goldfish needed relationship advice.",
        "I joined a staring contest with my ceiling fan and lost.",
        "My imaginary friend locked me out of the house.",
        "I was too busy practicing my Oscar speech in the shower.",
        "I fell into a Wikipedia rabbit hole about penguins.",
        "I was rehearsing my stand-up set for the toaster.",
        "I had to rescue my phone from falling into the couch abyss.",
        "I joined a cult of squirrels but they let me go at sundown.",
        "I spent three hours arguing with autocorrect."
      ]
    }
  ]
}
